MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32BG21A020F1024IM32/mcu.h
typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EFR32BG21A020F1024IM32_Part */

/**************************************************************************//**
 * @defgroup EFR32BG21A020F1024IM32_Peripheral_TypeDefs EFR32BG21A020F1024IM32 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
// #include "efr32bg21_emu.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_hfxo.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_hfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_fsrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_dpll.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_lfxo.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_lfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_ulfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_msc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_icache.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_prs.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_ldmaxbar.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_timer.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_usart.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_burtc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_lvgd.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_syscfg.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_buram.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_aes.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_bufc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_smu.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_iadc.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_semailbox.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_devinfo.h"  // Note: Changed for MikroE implementation.

/* Custom headers for LDMAXBAR and PRS mappings */
// #include "efr32bg21_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efr32bg21_ldmaxbar_defines.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFR32BG21A020F1024IM32_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup EFR32BG21A020F1024IM32_Peripheral_Base EFR32BG21A020F1024IM32 Peripheral Memory Map
 * @{
 *****************************************************************************/

#define EMU_S_BASE                (0x40004000UL) /* EMU_S base address */
#define CMU_S_BASE                (0x40008000UL) /* CMU_S base address */
#define HFXO0_S_BASE              (0x4000C000UL) /* HFXO0_S base address */
#define HFRCO0_S_BASE             (0x40010000UL) /* HFRCO0_S base address */
#define FSRCO_S_BASE              (0x40018000UL) /* FSRCO_S base address */
#define DPLL0_S_BASE              (0x4001C000UL) /* DPLL0_S base address */
#define LFXO_S_BASE               (0x40020000UL) /* LFXO_S base address */
#define LFRCO_S_BASE              (0x40024000UL) /* LFRCO_S base address */
#define ULFRCO_S_BASE             (0x40028000UL) /* ULFRCO_S base address */
#define MSC_S_BASE                (0x40030000UL) /* MSC_S base address */
#define ICACHE0_S_BASE            (0x40034000UL) /* ICACHE0_S base address */
#define PRS_S_BASE                (0x40038000UL) /* PRS_S base address */
#define GPIO_S_BASE               (0x4003C000UL) /* GPIO_S base address */
#define LDMA_S_BASE               (0x40040000UL) /* LDMA_S base address */
#define LDMAXBAR_S_BASE           (0x40044000UL) /* LDMAXBAR_S base address */
#define TIMER0_S_BASE             (0x40048000UL) /* TIMER0_S base address */
#define TIMER1_S_BASE             (0x4004C000UL) /* TIMER1_S base address */
#define TIMER2_S_BASE             (0x40050000UL) /* TIMER2_S base address */
#define TIMER3_S_BASE             (0x40054000UL) /* TIMER3_S base address */
#define USART0_S_BASE             (0x40058000UL) /* USART0_S base address */
#define USART1_S_BASE             (0x4005C000UL) /* USART1_S base address */
#define USART2_S_BASE             (0x40060000UL) /* USART2_S base address */
#define BURTC_S_BASE              (0x40064000UL) /* BURTC_S base address */
#define I2C1_S_BASE               (0x40068000UL) /* I2C1_S base address */
#define LVGD_S_BASE               (0x40074000UL) /* LVGD_S base address */
#define SYSCFG_S_BASE             (0x4007C000UL) /* SYSCFG_S base address */
#define BURAM_S_BASE              (0x40080000UL) /* BURAM_S base address */
#define GPCRC_S_BASE              (0x40088000UL) /* GPCRC_S base address */
#define RADIOAES_S_BASE           (0x44000000UL) /* RADIOAES_S base address */
#define BUFC_S_BASE               (0x44004000UL) /* BUFC_S base address */
#define SMU_S_BASE                (0x44008000UL) /* SMU_S base address */
#define RTCC_S_BASE               (0x48000000UL) /* RTCC_S base address */
#define LETIMER0_S_BASE           (0x4A000000UL) /* LETIMER0_S base address */
#define IADC0_S_BASE              (0x4A004000UL) /* IADC0_S base address */
#define ACMP0_S_BASE              (0x4A008000UL) /* ACMP0_S base address */
#define ACMP1_S_BASE              (0x4A00C000UL) /* ACMP1_S base address */
#define I2C0_S_BASE               (0x4A010000UL) /* I2C0_S base address */
#define HFRCOEM23_S_BASE          (0x4A014000UL) /* HFRCOEM23_S base address */
#define WDOG0_S_BASE              (0x4A018000UL) /* WDOG0_S base address */
#define WDOG1_S_BASE              (0x4A01C000UL) /* WDOG1_S base address */
#define SEMAILBOX_S_HOST_BASE     (0x4C000000UL) /* SEMAILBOX_S_HOST base address */
#define PRORTC_S_BASE             (0xA8000000UL) /* PRORTC_S base address */
#define EMU_NS_BASE               (0x50004000UL) /* EMU_NS base address */
#define CMU_NS_BASE               (0x50008000UL) /* CMU_NS base address */
#define HFXO0_NS_BASE             (0x5000C000UL) /* HFXO0_NS base address */
#define HFRCO0_NS_BASE            (0x50010000UL) /* HFRCO0_NS base address */
#define FSRCO_NS_BASE             (0x50018000UL) /* FSRCO_NS base address */
#define DPLL0_NS_BASE             (0x5001C000UL) /* DPLL0_NS base address */
#define LFXO_NS_BASE              (0x50020000UL) /* LFXO_NS base address */
#define LFRCO_NS_BASE             (0x50024000UL) /* LFRCO_NS base address */
#define ULFRCO_NS_BASE            (0x50028000UL) /* ULFRCO_NS base address */
#define MSC_NS_BASE               (0x50030000UL) /* MSC_NS base address */
#define ICACHE0_NS_BASE           (0x50034000UL) /* ICACHE0_NS base address */
#define PRS_NS_BASE               (0x50038000UL) /* PRS_NS base address */
#define GPIO_NS_BASE              (0x5003C000UL) /* GPIO_NS base address */
#define LDMA_NS_BASE              (0x50040000UL) /* LDMA_NS base address */
#define LDMAXBAR_NS_BASE          (0x50044000UL) /* LDMAXBAR_NS base address */
#define TIMER0_NS_BASE            (0x50048000UL) /* TIMER0_NS base address */
#define TIMER1_NS_BASE            (0x5004C000UL) /* TIMER1_NS base address */
#define TIMER2_NS_BASE            (0x50050000UL) /* TIMER2_NS base address */
#define TIMER3_NS_BASE            (0x50054000UL) /* TIMER3_NS base address */
#define USART0_NS_BASE            (0x50058000UL) /* USART0_NS base address */
#define USART1_NS_BASE            (0x5005C000UL) /* USART1_NS base address */
#define USART2_NS_BASE            (0x50060000UL) /* USART2_NS base address */
#define BURTC_NS_BASE             (0x50064000UL) /* BURTC_NS base address */
#define I2C1_NS_BASE              (0x50068000UL) /* I2C1_NS base address */
#define LVGD_NS_BASE              (0x50074000UL) /* LVGD_NS base address */
#define SYSCFG_NS_BASE            (0x5007C000UL) /* SYSCFG_NS base address */
#define BURAM_NS_BASE             (0x50080000UL) /* BURAM_NS base address */
#define GPCRC_NS_BASE             (0x50088000UL) /* GPCRC_NS base address */
#define RADIOAES_NS_BASE          (0x54000000UL) /* RADIOAES_NS base address */
#define BUFC_NS_BASE              (0x54004000UL) /* BUFC_NS base address */
#define SMU_NS_BASE               (0x54008000UL) /* SMU_NS base address */
#define RTCC_NS_BASE              (0x58000000UL) /* RTCC_NS base address */
#define LETIMER0_NS_BASE          (0x5A000000UL) /* LETIMER0_NS base address */
#define IADC0_NS_BASE             (0x5A004000UL) /* IADC0_NS base address */
#define ACMP0_NS_BASE             (0x5A008000UL) /* ACMP0_NS base address */
#define ACMP1_NS_BASE             (0x5A00C000UL) /* ACMP1_NS base address */
#define I2C0_NS_BASE              (0x5A010000UL) /* I2C0_NS base address */
#define HFRCOEM23_NS_BASE         (0x5A014000UL) /* HFRCOEM23_NS base address */
#define WDOG0_NS_BASE             (0x5A018000UL) /* WDOG0_NS base address */
#define WDOG1_NS_BASE             (0x5A01C000UL) /* WDOG1_NS base address */
#define SEMAILBOX_NS_HOST_BASE    (0x5C000000UL) /* SEMAILBOX_NS_HOST base address */
#define PRORTC_NS_BASE            (0xB8000000UL) /* PRORTC_NS base address */

#if defined(SL_COMPONENT_CATALOG_PRESENT)
// #include "sl_component_catalog.h"  // Note: Changed for MikroE implementation.

#endif
#if defined(SL_CATALOG_TRUSTZONE_SECURE_CONFIG_PRESENT)
// #include "sl_trustzone_secure_config.h"  // Note: Changed for MikroE implementation.

#endif

